Revit 2024 API
MEPNetworkSegmentData.IsValid Method
 Verified if this segment data has been assigned some valid values afer calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if the segment was assigned valid values, otherwise false.
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace